{
  "ru": {
    "title": "Настройка VPS сервера",
    "description": "Быстрая настройка и конфигурация вашего VPS сервера",
    "content": [
      {
        "title": "Основные",
        "blocks": [
          {
            "title": "Подключение к серверу",
            "description": "Подключение к VPS по SSH. После ввода команды потребуется ввести пароль пользователя (пароль не отображается).",
            "steps": [
              {
                "text": "Если подключения прежде были можно попробовать их обнулить с помощью команды:",
                "code": " ssh-keygen -R {server_ip}"
              }
            ],
            "code": "ssh root@{server_ip}"
          },
          {
            "title": "Обновление системы",
            "description": "Обновляет список пакетов и устанавливает последние доступные обновления.",
            "code": "sudo apt update && sudo apt upgrade -y"
          },
          {
            "title": "Создание нового пользователя и добавление в sudo",
            "description": "Создаёт нового пользователя и даёт ему права администратора (через группу sudo). При создании потребуется придумать пароль и при желании заполнить дополнительные данные (они необязательны и могут быть пропущены нажатием Enter).",
            "code": "adduser {username} && usermod -aG sudo {username}"
          },
          {
            "title": "Переключение на нового пользователя",
            "description": "После создания нового пользователя рекомендуется работать под его именем. Для этого используйте команду ниже и введите пароль нового пользователя.",
            "code": "su - {username}"
          }
        ]
      },
      {
        "title": "SSH ключи",
        "blocks": [
          {
            "title": "Создание SSH-ключа ed25519 с заданным именем и путём",
            "description": "Генерирует SSH-ключ типа ed25519 с возможностью указать комментарий (-C) и путь к файлу (-f). Ключ будет сохранён в указанную папку.",
            "steps": [
              {
                "text": "Откройте терминал на основной машине. Чтобы выйти из текущего подключения можно выполнить команду ниже или открыть новый терминал",
                "code": "exit"
              },
              {
                "text": "Вставьте команду, указав свой комментарий (например, имя или email) и путь к нужной папке/файлу.",
                "code": "ssh-keygen -t ed25519 -C \"{ssh_comment}\" -f {ssh_path_to_key}"
              },
              "Нажмите Enter. Если папка не существует, создайте её предварительно: mkdir -p ~/.ssh/vps",
              "При желании введите passphrase для ключа или оставьте пустым."
            ]
          },
          {
            "title": "Копировать SSH-ключ на сервер",
            "description": "Передаёт публичный ключ на сервер для входа без пароля.",
            "steps": [
              "Убедитесь, что сервер доступен по SSH.",
              {
                "text": "Выполните команду:",
                "code": "ssh-copy-id -i {ssh_path_to_key}.pub {username}@{server_ip}"
              },
              "Введите пароль пользователя сервера по запросу.",
              "Теперь для входа будет использоваться ваш SSH-ключ без необходимости каждый раз вводить пароль."
            ]
          },
          {
            "title": "Настройка подключения в ~/.ssh/config",
            "description": "Позволяет создать простую команду alias для подключения к серверу без ввода IP, логина и пути к ключу каждый раз.",

            "steps": [
              {
                "text": "Откройте или создайте файл конфигурации:",
                "code": { "text": "nano ~/.ssh/config", "showArrow": true }
              },
              {
                "text": "Добавьте в файл блок (замените значения на свои):",
                "code": {
                  "text": "Host {host_name}\n\tHostName {server_ip}\n\tUser {username}\n\tPort {ssh_port}\n\tIdentityFile {ssh_path_to_key}.pub\n\tIdentitiesOnly yes",
                  "showArrow": false
                }
              },

              "Сохраните файл (Ctrl+O), затем выйдите из редактора (Ctrl+X).",
              {
                "text": "Проверьте права доступа:",
                "code": "chmod 600 ~/.ssh/config"
              }
            ]
          },
          {
            "title": "Alias",
            "description": "После настройки на серверы вы сможете подключатся к серверу через alias:",
            "code": "ssh {host_name}"
          }
        ]
      },
      {
        "title": "Настройка сервера",
        "blocks": [
          {
            "title": "Смена порта SSH, отключение входа по паролю и для root",
            "description": "Улучшает безопасность сервера: настраивает нестандартный порт SSH, запрещает вход по паролю и отключает прямой доступ для пользователя root.",

            "steps": [
              {
                "text": "Зайдите на сервер",
                "code": { "text": "ssh {username}@{server_ip}" }
              },
              {
                "text": "Откройте файл конфигурации SSH:",
                "code": "sudo nano /etc/ssh/sshd_config"
              },
              {
                "text": "Найдите или добавьте следующие строки и задайте нужные значения:",
                "code": {
                  "text": "Port {ssh_port}\nPermitRootLogin no\nPasswordAuthentication no",
                  "separateLines": "true"
                }
              },
              "Проверьте, чтобы строки не были закомментированы (без символа # в начале).",
              "Сохраните изменения (Ctrl+O), нажмите Enter и выйдите из редактора (Ctrl+X).",
              {
                "text": "Разрешите новый порт в брандмауэре (если используется UFW):",
                "code": "sudo ufw allow {ssh_port}/tcp && sudo ufw reload"
              },
              {
                "text": "Перезапустите SSH-сервис, чтобы применить обновлённые настройки:",
                "code": "sudo systemctl restart ssh"
              },
              {
                "text": "Теперь можно подключаться по имени alias (возможно снова придется ввести код пользователя {username}):",
                "code": "ssh {host_name}"
              }
            ],
            "note": "Не закрывайте активную SSH-сессию, пока не убедитесь, что можно подключиться по новому порту. Убедитесь, что SSH-ключи настроены и пользователь имеет доступ с sudo. Выбранный порт должен быть в диапазоне 1024–65535 и не использоваться другими службами."
          }
        ]
      }
    ]
  },

  "en": {
    "title": "VPS Server Setup",
    "description": "Quick setup and configuration of your VPS server",
    "content": [
      {
        "title": "Basics",
        "blocks": [
          {
            "title": "Connecting to the server",
            "description": "Connecting to the VPS via SSH. After entering the command, you will need to enter the user password (the password will not be displayed).",
            "steps": [
              {
                "text": "If there were previous connections, you can try to reset them with the command:",
                "code": "ssh-keygen -R {server_ip}"
              }
            ],
            "code": "ssh root@{server_ip}"
          },
          {
            "title": "System update",
            "description": "Updates the package list and installs the latest available upgrades.",
            "code": "sudo apt update && sudo apt upgrade -y"
          },
          {
            "title": "Creating a new user and adding to sudo",
            "description": "Creates a new user and grants them administrator rights (via the sudo group). You will need to come up with a password and optionally fill additional data (optional and can be skipped by pressing Enter).",
            "code": "adduser {username} && usermod -aG sudo {username}"
          },
          {
            "title": "Switching to the new user",
            "description": "After creating the new user, it is recommended to work under their account. Use the command below and enter the new user's password.",
            "code": "su - {username}"
          }
        ]
      },
      {
        "title": "SSH Keys",
        "blocks": [
          {
            "title": "Creating an ed25519 SSH key with a specified name and path",
            "description": "Generates an ed25519 SSH key with the ability to specify a comment (-C) and a file path (-f). The key will be saved in the specified folder.",
            "steps": [
              "Open a terminal.",
              {
                "text": "Enter the command specifying your comment (e.g., name or email) and the path to the desired folder/file.",
                "code": "ssh-keygen -t ed25519 -C \"{ssh_comment}\" -f {ssh_path_to_key}"
              },
              "Press Enter. If the folder does not exist, create it in advance: mkdir -p ~/.ssh/vps",
              "Optionally enter a passphrase for the key or leave it empty."
            ]
          },
          {
            "title": "Copying the SSH key to the server",
            "description": "Copies the public key to the server for passwordless login.",
            "steps": [
              "Ensure the server is accessible via SSH.",
              {
                "text": "Run the command:",
                "code": "ssh-copy-id -i {ssh_path_to_key}.pub {username}@{server_ip}"
              },
              "Enter the server user's password when requested.",
              "Now you will be able to log in using your SSH key without entering a password each time."
            ]
          },
          {
            "title": "Configuring connection in ~/.ssh/config",
            "description": "Allows creating a simple alias command for connecting to the server without entering IP, login, and key path every time.",
            "steps": [
              {
                "text": "Open or create the configuration file:",
                "code": { "text": "nano ~/.ssh/config", "showArrow": true }
              },
              {
                "text": "Add the following block to the file (replace values with your own):",
                "code": {
                  "text": "Host {host_name}\n\tHostName {server_ip}\n\tUser {username}\n\tPort {ssh_port}\n\tIdentityFile {ssh_path_to_key}.pub\n\tIdentitiesOnly yes",
                  "showArrow": false
                }
              },
              "Save the file (Ctrl+O), then exit the editor (Ctrl+X).",
              {
                "text": "Check permissions:",
                "code": "chmod 600 ~/.ssh/config"
              },
              {
                "text": "After configuration, you can connect to the server via alias:",
                "code": "ssh {host_name}"
              }
            ]
          }
        ]
      },
      {
        "title": "Server Configuration",
        "blocks": [
          {
            "title": "Changing SSH port, disabling password and root login",
            "description": "Enhances server security: configures a non-standard SSH port, disables password login and direct access for the root user.",
            "steps": [
              {
                "text": "Open the SSH configuration file:",
                "code": "sudo nano /etc/ssh/sshd_config"
              },
              {
                "text": "Find or add the following lines and set the desired values:",
                "code": {
                  "text": "Port {ssh_port}\nPermitRootLogin no\nPasswordAuthentication no",
                  "separateLines": "true"
                }
              },
              "Make sure the lines are not commented out (no # at the line start).",
              "Save changes (Ctrl+O), press Enter and exit the editor (Ctrl+X).",
              {
                "text": "Allow the new port in the firewall (if using UFW):",
                "code": "sudo ufw allow {ssh_port}/tcp && sudo ufw reload"
              },
              {
                "text": "Restart the SSH service to apply the updated settings:",
                "code": "sudo systemctl restart ssh"
              },
              {
                "text": "You can now connect using the alias name (you may need to enter the {username} code again):",
                "code": "ssh {host_name}"
              }
            ],
            "note": "Do not close the active SSH session until you verify that you can connect via the new port. Ensure SSH keys are set up and the user has sudo access. The chosen port should be between 1024–65535 and not used by other services."
          }
        ]
      }
    ]
  }
}
